Repository: loginom/admin-guide-l10n
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Заполняется сформированным SOAP-пакетом или телом REST-сообщения в зависимости от значения параметра Формат сообщения
en: is filled in by the formed SOAP package or REST message body according to the value of the Message format parameter/

source: Запрограммированный шаблон ключа Guardant SP (файл вида *.grdvd).
en: Programed template of Guardant SP dongle (*.grdvd file).

source: Запуск инсталлятора
en: Run the Installer

source: Запуск служб
en: Start of Services

source: Запуск службы "LoginomHttpd": net start httpd_loginom
en: The "LoginomHttpd" service start: net start httpd_loginom

source: Запуск службы "LoginomServer": net start loginom
en: The "LoginomServer" service start: net start loginom

source: Запустить web-клиент Loginom Studio
en: Start the Loginom Studio web client

source: Запустить диспетчер служб IIS можно командой inetmgr через меню Выполнить.
en: It is possible to run the IIS service manager by the inetmgr command using the Run menu.

source: Запустить инсталлятор продукта, нажать кнопку "Удалить"
en: Run the product installer, pressing the"Remove" button

source: Запустить инсталлятор продукта, нажать кнопку "Удалить".
en: To run the product installer having pressed the "Uninstall" button

source: Затем содержимое ответа передается на обработку командой ОС с использованием параметров Исходное имя файла ответа, Результирующее имя файла ответа, Команда обработки файла ответа.
en: Then the response content is transferred for processing by the OS command by applying the following parameters: The response file source name, The resulting name of the response file, The response file processing command.

source: Здесь в теле скрипта описаны параметры MemberCode, UserID, Password, принимающие значения, заданные в Конфигураторе.
en: MemberCode, UserID, Password parameters, taking the values specified in the Configurator, are described in the script body.

source: Здесь шаблоны %inputFile% и %outputFile% при выполнении команды заменяются на значения параметров Исходное имя файла запроса и Результирующее имя файла запроса соответственно.
en: While command executing, %inputFile% and %outputFile% templates are replaced with the values of the following parameters: The request file source name and The resulting name of the request file correspondingly.

source: Значение plainXml параметра задает формат REST-сообщения.
en: The value of the plainXml parameter is set according to the REST message format.

source: Значение plainXml параметра задает режим работы с внешним сервисом как с REST-сервисом.
en: The value of plainXml parameter enables assignment of mode of the external service operation, as with the REST service.

source: Значение зависит от веб-сервиса, к которому осуществляется подключение.
en: The value depends on the web service to which you are connecting.

source: Значение параметра используется в качестве составной части имен (name) элементов и атрибутов WSDL-описания веб-сервиса Адаптера.
en: The parameter value is used as a part of the names (name) of items and attributes in the WSDL description of the Adapter web service.

source: Значение по умолчанию
en: Default value

source: Значение по умолчанию.
en: Default value.

source: Значение по умолчанию: 0;
en: Default value: 0;

source: Значение по умолчанию: 4850.
en: Default value: 4850.

source: Значение по умолчанию: 0.0.0.0.
en: Default value: 0.0.0.0.

source: Значение по умолчанию: 4580.
en: Default value: 4580.

source: Значение по умолчанию: 8080.
en: Default value: 8080.

source: Значение по умолчанию: All.
en: Default value: All.

source: Значение по умолчанию: Logs.
en: Default value: Logs.

source: Значение по умолчанию: localhost.
en: Default value: localhost.

source: Значением может быть полный или относительный (от рабочего каталога) путь.
en: The value can be a full or relative path (from the working directory).

source: Значением может быть полный или относительный (от файла конфигурации) путь.
en: The value cab be both full and relative (from the configuration file) path.

source: Значения soap, soap12 параметра задают режим работы с внешним сервисом как с SOAP-сервисом в спецификациях 1.1 и 1.2 соответственно.
en: The values of soap, soap12 parameter enable assignment of mode of the external service operation, as with the SOAP service in Specifications 1.1 and 1.2 correspondingly.

source: Значения soap и soap12 параметра задают формат SOAP-сообщения в спецификациях 1.1 и 1.2 соответственно.
en: The value of the soap and soap12 parameters are set according to the SOAP message format in Specifications 1.1 and 1.2 correspondingly.

source: Значения параметра Описание веб-сервиса задает содержание узлов WSDL <wsdl:documentation> и используется для произвольного описания сервисов.
en: Values of The web service description parameter are set by content of the <wsdl:documentation> WSDL nodes, and they are used for the arbitrary description of the services.

source: Из командной строки выполнить обновление можно указав ключ DOUPGRADE=1:
en: Upgrade is possible using the command line and specifying the DOUPGRADE=1 key:

source: Из окна "Программы и компоненты" в Windows;
en: Use the "Programs and Features" window in Windows

source: Изменение количества пользователей компонентов продукта
en: Change of the number of the product components users

source: Изменение состава компонентов продукта
en: Change of composistion of the product components

source: Имена файлов так же можно задавать в виде шаблона с использованием конструкции %guid%.
en: The files names can be also specified as a template with usage of the %guid% construction.

source: Имя web-приложения IIS
en: IIS web application name

source: Имя веб-сервиса
en: The web service name

source: Имя корневого элемента SOAP ответа; Namespace корневого элемента SOAP ответа
en: The root element name of the SOAP response; Namespace of the root element of the SOAP response

source: Имя метода
en: Method name

source: Имя метода в Loginom Adapter
en: Method name in the Loginom Adapter

source: Имя сайта IIS
en: IIS site name

source: Имя создаваемого пула приложений IIS
en: Name of the created IIS application pool

source: Имя учетной записи Loginom Server
en: Loginom Server account name

source: Имя файла журнала - log.log.
en: Log file name - log.log.

source: Имя файла журнала - logger-internal.log.
en: Log file name - logger-internal.log.

source: Имя файла инсталлятора: LoginomIntegrator_6.x.x.msi, где 6.x.x – цифры, обозначающие версию и релиз программы.
en: The installer file name: LoginomIntegrator_6.x.x.msi, where 6.x.x – figures denoting software version and release.

source: Инструкции для IIS 8.5
en: IIS 8.5 Instructions

source: Интерфейс Конфигуратора состоит из двух панелей.
en: The Configurator interface consists of two panels.

source: Использовать websocket proxy (0,1)
en: Use websocket proxy (0,1)

source: Использовать шифрование (https) (0,1)
en: Use encryption (https) (0,1)

source: Использовать шифрование для websocket (0,1)
en: Use encryption for websocket (0,1)

source: Используемые в работе Адаптера сертификаты могут хранится:
en: The certificates used for the Adapter operation can be kept using the following path:

source: Используемые для заполнения параметры Конфигуратора
en: The parameters of the Configurator used for filling in

source: Используется для работы с БКИ «ОКБ».
en: It is used in the process of work with credit reference bureau "UNITED CREDIT BUREAU".

source: Источник событий в журнале Windows: Loginom Integrator.
en: Event source in Windows log: Loginom Integrator.

source: Каждому режиму можно задать минимальный уровень детализации:
en: It is possible to assign the minimum level of detail to each mode:

source: Как видно из рисунка 8, первым действием после получения SOAP-запроса из сценария Loginom является выделение текста xml-запроса из SOAP-пакета.
en: As is shown in Figure 8, the first action after the SOAP request receipt from Loginom workflow is the XML request text selection from the SOAP package.

source: Как правило, дополнительные файлы этих настроек размещаются в подкаталогах Data и Certificates каталога установки (по умолчанию это C:\inetpub\wwwroot\LoginomAdapter\).
en: As a rule, the additional files of such settings are placed into the following subdirectories: Data and Certificates of the installation directory (by default it is C:\inetpub\wwwroot\LoginomAdapter\).

source: Каталог установки
en: Installation directory

source: Клавиатура, мышь
en: Keyboard, mouse

source: Клиентское веб-приложение, реализующее пользовательский интерфейс работы с платформой.
en: The client web application implementing the user interface of the platform operation.

source: Ключ
en: Key

source: Ключевой элемент платформы.
en: Key platform element.

source: Коллективная работа
en: Teamwork

source: Командная строка
en: Command Line

source: Компонент
en: Component

source: Компонент "Loginom Personal" обязателен для установки.
en: The "Loginom Personal" component is compulsory for installation.

source: Компонент "Документация" устанавливает файлы документации по работе с платформой.
en: The "Documentation" component enables the installation of document files for the platform operation.

source: Компонент Desktop входит в редакцию редакцию платформы Loginom Personal.
en: The desktop component is included in the Loginom Personal platform version.

source: Компонент платформы, функционирующий в виде приложения для Internet Information Services (IIS) и предоставляющий возможность публиковать собственные веб-сервисы.
en: It is a platform component running as an application for Internet Information Services (IIS) and allowing for publication of the own web services.

source: Компонент, необходимый для интеграции с нестандартными веб-сервисами.
en: The component required for integration with nonstandard web services.

source: Компонент, необходимый для публикации веб-сервисов.
en: The component required for publication of web services.

source: Компьютер, где будет выполняться активация, должен иметь доступ к серверу активации по адресу https://sp.guardant.ru в процессе инициализации ключа.
en: It is required to provide access to the activation server for the computer used for activation at the following address: https://sp.guardant.ru in the process of the dongle initialization.

source: Конечным результатом этапов трансформации XML-запроса является формирование запроса в индивидуальном формате, заданном в описании внешнего сервиса, и может представлять собой XML, JSON, двоичные данные, текст и т.д.
en: The final result of the XML request transformation stages is the formation of the request in the individual format specified in the external service description, and it can be XML, JSON, binary data, text, etc.

source: Конечным результатом этапов трансформации должно стать формирование XML-ответа, структура которого соответствует XSD-схеме описания сервиса.
en: The final result of the transformation stages is the formation of the XML response, the structure of which complies with the XSD schema of the service description.

source: Конкурентные лицензии позволяют приобретать меньшее количество ПО в связи с тем, что количество одновременно запущенных приложений ограничивается.
en: Competitive licenses enable acquisition of less software, as the number of simultaneously started applications is limited.

source: Конфигурация Loginom Adapter
en: Loginom Adapter Configuration

source: Конфигурация Loginom Integrator
en: Loginom Integrator Configuration

source: Корневой элемент Настройки.
en: The root element Settings.

source: Корневые элементы, обозначающие внешние сервисы, с которыми осуществляется взаимодействие (в конфигурации, представленной на рисунке 3, присутствуют три таких элемента: DEMO, EquifaxFPS , NBCH).
en: The root elements denoting the external services interacted with (the configuration shown in Figure 3 includes three such elements: DEMO, EquifaxFPS, NBCH).

source: Кроме отправки и получения сообщений, web-сервис Адаптера формирует WSDL-описание сервиса.
en: Apart from the sending and receipt of messages, the Adapter web service forms the WSDL service description.

source: Лицензии
en: Licenses

source: Лицензии конкурентные, то есть ограничивается количество компьютеров (или сессий терминала), на которых запущены приложения Loginom.
en: The licenses are competitive. It means that the number of computers (or terminal sessions) on which Loginom applications have been started is limited.

source: Лицензирование продуктов Loginom осуществляется с помощью ключей Guardant:
en: Loginom products are licensed by means of Guardant dongles:

source: Локальный USB-ключ
en: Local USB Dongle

source: Мастер производит необходимый обмен информацией с драйвером ключа и сервером активации.
en: The wizard will perform the required exchange of information with the dongle driver and activation server.

source: Методы, по которым осуществляется взаимодействие с соответствующими внешними сервисами, представлены подчиненными элементами с наименованиями методов (на рисунке 3 это элементы: Value, processingApplicationRequest, deleteApplicationRequest и другие).
en: Methods of interaction with the relevant external services are represented by the subordinate elements with method names (the following elements are shown in Figure 3: Value, processingApplicationRequest, deleteApplicationRequest, etc).

source: Минимально должны быть установлены следующие роли сервера (windows 2016):
en: The following server roles (windows 2016) must be installed at a minimum:

source: Минимальные
en: Minimum

source: Модуль требуется для работы Loginom Studio в браузерах Internet Explorer v11+ / Edge.
en: The module is required for the Loginom Studio operation in Internet Explorer v11+ / Edge browsers.

source: Может принимать значения: default, experianEncoding.
en: It can take the following values: default, and experianEncoding.

source: Может принимать значения: utf-8, windows-1251.
en: It can take the following values: utf-8, and/or windows-1251.

source: На TCP порт 80|443 (http(s)) для хостов клиентов (браузеры)
en: To the TCP port 80|443 (http(s)) for the client hosts (browsers)

source: На левой панели окна Конфигуратора располагается дерево навигации (см.
en: The navigation tree is on the left window panel of the Configurator (refer to

source: На следующем этапе полученный в результате предыдущих преобразований запрос в случае формирования REST-запроса помещается в тело HTTP/HTTPS пакета (Entity Body), отправляемого внешнему сервису, в случае SOAP-запроса – помещается внутрь узла Body SOAP-пакета.
en: At the next stage, the request received in the result of the previous transformations in the case of the REST request formation is placed into the HTTP/HTTPS package body (Entity Body) sent to the external service. In the case of the SOAP request, it is placed into the Body node of the SOAP package.

source: На этапе настройки рекомендуется включить режим отладки и логирование запросов и ответов.
en: At the configuration stage, it is recommended to enable the debug mode and logging of requests and responses.

source: На этапе отправки пакета при реализации HTTPS соединения применяется шифрование с использованием сертификата.
en: At the stage of the package sending during the HTTPS connection implementation, encryption with the cerificate usage is applied.

source: Нажатие на кнопку "Обновить" выполняет обновление установленного экземпляра Loginom Integrator.
en: Pressing the "Upgrade" button will enable the upgrade of the installed Loginom Integrator.

source: Нажатие на кнопку "Обновить" выполняет обновление установленного экземпляра Loginom.
en: Pressing the "Upgrade" will enable the upgrade of the installed Loginom product.

source: Нажатие на кнопку "Переустановить" запускает диалог новой установки продукта.
en: Pressing the "Reinstall" button will open a new product installation dialog.

source: Нажмите на кнопку "Далее":
en: Press "Next":

source: Назначение
en: Designation

source: Направляет преобразованный запрос во внешний веб-сервис;
en: Sends the transformed request to the external web service

source: Например, значения параметров Имя веб-сервиса формируют уникальные имена элементов <wsdl:portType>, описывающих сервисы, предоставляемые веб-сервисом Адаптера, а значения параметров Имя метода в Loginom Adapter формируют уникальные имена элементов <wsdl:operation>, описывающих методы этих сервисов.
en: For example, values of The web service name parameter form the unique names of the <wsdl:portType> elements describing the services represented by the Adapter web service, and values of the Method name in the Loginom Adapter parameter form the unique names of the <wsdl:operation> elements describing methods of these services.

source: Например, на основе шаблона "%guid%_reg.xml" вместо %guid% в имя файла будет подставлен случайно сгенерированный GUID.
en: For example, based on the "%guid%_reg.xml" template a randomly generated GUID will be inserted into the file name instead of %guid%.

source: Настольные компоненты, предназначенные для автономной обработки данных на персональном компьютере, доступны в редакциях Academic и Personal.
en: Desktop components designated for stand-alone data processing using personal computers. Academic and Personal editions are available.

source: Настройка WebSocket Proxy
en: WebSocket Proxy Configuring

source: Настройка выполнения этого этапа осуществляется параметром Особый формат сообщения.
en: This stage is configured by means of the Special message format parameter.

source: Настройка выполнения этого этапа производится с помощью параметров Конфигуратора XSLT для трансформации входящего сообщения перед передачей и Параметры XSLT, представленных на рисунке 9.
en: This stage is configured by means of parameters of the XSLT Configurator for transformation of the incoming message before transfer and XSLT Parameters, as shown in Figure 9.

source: Настройка роли SOAP-сервиса
en: Configuration of the SOAP Service Role

source: Настройка роли клиента внешних сервисов
en: Configuration of the Client Role of the External Services

source: Настройки Loginom Adapter хранятся в xml-файле Web.config, редактирование которого осуществляется программой Loginom Adapter Configurator (далее по тексту Конфигуратор).
en: Loginom Adapter settings are in the Web.config XML file, edited by the Loginom Adapter Configurator (hereafter referred to as the Configurator).

source: Настройки метода взаимодействия с внешним сервисом
en: Settings of method of interaction with the external service

source: Настройки подключения к одному из внешних сервисов
en: Settings of connection to one of the external services

source: Настрольная версия платформы предназначена для установки на локальной компьютере, когда подразумевается работа одного пользователя.
en: The desktop version of the platform is designated for installation on the local computer when only one user operation is anticipated.

source: Не может произойти ситуация блокировки лицензии из-за того, что пользователь на другой машине не закрыл приложение Loginom;
en: License cannot be suspended due to the fact that a user didn't close Loginom on other computer.

source: Не требует инсталляции, т.к. взаимодействие осуществляется через браузер.
en: It is not required to install it as interaction is provided by means of browser.

source: Необходимо выполнить в командной строке от имени администратора:
en: It is required to execute the following command in the command line as an administrator:

source: Необходимо установить следующие компоненты:
en: It is required to install the following components:

source: Необходимость перепрограммирования USB-ключа возникает при покупке дополнительных лицензий на компоненты или опции Loginom, — в этом случае выполняется дистанционное изменение содержимого памяти ключа с обменом специальными кодами по электронной почте.
en: It is required to reprogram USB dongle in the case of acquisition of additional licenses for Loginom components or options. In that case, remote changing of the dongle memory content with exchange of special codes by e-mail is required.

source: Необязательный параметр.
en: The optional parameter.

source: Но некоторые веб-сервисы, например, БКИ используют индивидуальные протоколы и шифрование данных, при которых взаимодействовать с ними стандартными средствами Loginom невозможно.
en: But some web services, for example, CRB, use the individual protocols and data encryption which preclude interaction using the standard Loginom means.

source: Новые файлы создаются раз в сутки, старые лог-файлы получают имена вида log.yyyy-MM-dd.log.
en: New files are created once a day, old log files receive names of the log.yyyy-MM-dd.log type.

source: Обновление Loginom Desktop
en: Loginom Desktop Upgrade

source: Обновление Loginom Integrator
en: Loginom Integrator Upgrade

source: Обновление Loginom Server
en: Loginom Server Upgrade

source: Обновление аппаратных USB-ключей
en: Upgrade of Hardware USB Dongles

source: Обновление памяти электронного ключа
en: Upgrade of the elecronic dongle memory

source: Общие настройки задаются в атрибутах элемента Logging/Common:
en: The general settings are set in the attributes of the Logging/Common element:

source: Общие настройки представлены следующими параметрами:
en: The general settings are represented by the following parameters:

source: Общие настройки сервера
en: Server General Settings

source: Общие настройки сервера хранятся в xml файле Settings.cfg.
en: The server general settings are kept in the XML Settings.cfg file.

source: Общие настройки
en: The general settings

source: Обязательное программное обеспечение
en: Required Software

source: Обязательный атрибут.
en: The required attribute.

source: Обязательный параметр.
en: The required parameter.

source: Оперативная память
en: Immediate-access store

source: Операционная система
en: Operating system

source: Описание
en: Description

source: Описание веб-сервиса
en: The web service description

source: Описание метода
en: Method description

source: Описание параметров настроек
en: Description of the Configuration Parameters

source: Определения всех сообщений запросов и ответов описываются отдельными элементами импортируемой схемы, и представлены узлами WSDL <wsdl:message>.
en: Definitions of all requests and response messages are provided by the separate elements of the imported schema, and they are represented by the WSDL nodes <wsdl:message>.

source: Определяет вызываемый метод внешнего SOAP-сервиса.
en: It defines the called method of the external SOAP service.

source: Опциональное программное обеспечение
en: Optional Software

source: Особенности:
en: Features:

source: Особо полезными могут быть:
en: The following commands can be especially useful:

source: Отправка сформированного пакета осуществляется по адресу, указанному в параметре URL для отправки запроса.
en: The formed package is sent at the address specified in the URL for the request sending parameter.

source: Параметр XSLT для трансформации входящего сообщения перед передачей содержит путь к скрипту xslt.
en: The XSLT for transformation of the incoming message before transfer parameter contains the path to the XSLT script.

source: Параметр указывается в зависимости от требований к настройке соответствующего веб-сервиса.
en: The parameter is specified under the requirements to the corresponding web service settings.

source: Параметры Имя веб-сервиса, Имя метода, Имя метода в Loginom Adapter участвуют в формировании имен элементов WSDL-описания сервиса.
en: The web service name, Method name, Method name in the Loginom Adapter parameters participate in the formation of the elements' name of the service WSDL description.

source: Параметры Loginom Server
en: Loginom Server Parameters
